Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: The budget widget will showcase your budget amount and monitor your spending effectively.
th_th: วิดเจ็ตงบประมาณจะแสดงจำนวนงบประมาณของคุณและติดตามการใช้จ่ายของคุณอย่างมีประสิทธิภาพ

source: Budget widget
th_th: วิดเจ็ตงบประมาณ

source: Select the compensation elements to display in the worker compensation history and define the number of past events to show.
th_th: เลือกองค์ประกอบค่าตอบแทนที่จะแสดงในประวัติค่าตอบแทนของพนักงาน และกำหนดจำนวนเหตุการณ์ที่ผ่านมาให้แสดง

source: Enable compensation element
th_th: เปิดใช้งานองค์ประกอบค่าตอบแทน

source: Number of events
th_th: จำนวนเหตุการณ์

source: Worker compensation history
th_th: ประวัติการชดเชยของพนักงาน

source: Column list
th_th: รายการคอลัมน์

source: Add column to group
th_th: เพิ่มคอลัมน์เข้ากลุ่ม

source: No columns yet
th_th: ยังไม่มีคอลัมน์

source: Remove column from group
th_th: ลบคอลัมน์ออกจากกลุ่ม

source: Search for columns to add
th_th: ค้นหาคอลัมน์ที่จะเพิ่ม

source: Columns in the group
th_th: คอลัมน์ในกลุ่ม

source: Add column
th_th: เพิ่มคอลัมน์

source: No groups yet
th_th: ยังไม่มีกลุ่ม

source: Group list
th_th: รายชื่อกลุ่ม

source: Group name
th_th: ชื่อกลุ่ม

source: Remove group
th_th: ลบกลุ่ม

source: Manage column groups
th_th: จัดการกลุ่มคอลัมน์

source: Config
th_th: การกำหนดค่า

source: Manage group columns
th_th: จัดการคอลัมน์กลุ่ม

source: Bonus
th_th: โบนัส

source: Calculated column
th_th: คอลัมน์ที่คำนวณ

source: Comp element
th_th: องค์ประกอบผลตอบแทน

source: Data foundation
th_th: มูลนิธิข้อมูล

source: Category
th_th: หมวดหมู่

source: Column {{columnName}} visibility
th_th: การแสดงผลคอลัมน์ {{columnName}}

source: Create custom column
th_th: สร้างคอลัมน์ที่กำหนดเอง

source: Drop-down list options
th_th: ตัวเลือกแบบรายการดรอปดาวน์

source: The label cannot empty.
th_th: ป้ายกำกับต้องไม่เว้นว่าง

source: No options yet
th_th: ยังไม่มีตัวเลือก

source: The code and the label cannot be empty.
th_th: รหัสและป้ายกำกับไม่สามารถว่างเปล่าได้

source: Please add at least one option.
th_th: โปรดเพิ่มตัวเลือกอย่างน้อยหนึ่งรายการ

source: Enter the text displayed as a tooltip on hover
th_th: ป้อนข้อความที่แสดงเป็นคำอธิบายเครื่องมือเมื่อเลื่อนเมาส์ไปอยู่เหนือ

source: The column name cannot be empty.
th_th: ชื่อคอลัมน์ต้องไม่เว้นว่าง

source: Drop-down list
th_th: รายการดรอปดาวน์

source: Text field
th_th: ฟิลด์ข้อความ

source: The type cannot be empty.
th_th: ประเภทต้องไม่เว้นว่าง

source: Conditional formatting
th_th: การจัดรูปแบบตามเงื่อนไข

source: Delete rule
th_th: ลบกฎ

source: Rules higher in the list take priority when configurations overlap. You can create up to 10 rules.
th_th: กฎที่อยู่สูงกว่าในรายการจะมีความสำคัญมากกว่าเมื่อการตั้งค่าซ้อนทับกัน คุณสามารถสร้างกฎได้สูงสุด 10 กฎ

source: Rules higher in the list take priority when configurations overlap.
th_th: กฎที่อยู่สูงกว่าในรายการจะมีความสำคัญมากกว่าเมื่อการตั้งค่าซ้อนทับกัน

source: Conditional formatting rule
th_th: กฎการจัดรูปแบบตามเงื่อนไข

source: No conditional formatting rules yet.
th_th: ยังไม่มีเงื่อนไขการจัดรูปแบบ

source: Background color
th_th: สีพื้นหลัง

source: Define how the cell will be formatted when the criteria are met.
th_th: กำหนดวิธีการจัดรูปแบบเซลล์เมื่อเงื่อนไขตรงตามที่กำหนด

source: Enter a name for this rule.
th_th: กรุณากรอกชื่อสำหรับกฎนี้

source: Add a name and a description to the rule
th_th: เพิ่มชื่อและคำอธิบายให้กับกฎนี้

source: View conditional formatting
th_th: ดูการจัดรูปแบบตามเงื่อนไข

source: Proposal management
th_th: การจัดการข้อเสนอ

source: View proposal management settings
th_th: ดูการตั้งค่าการจัดการข้อเสนอ

source: Custom column
th_th: คอลัมน์ที่กำหนดเอง

source: Groups
th_th: กลุ่ม

source: Up to 20 calculated columns allowed per compensation round.
th_th: อนุญาตให้มีคอลัมน์ที่คำนวณได้สูงสุด 20 คอลัมน์ต่อรอบการชดเชย

source: Calculated
th_th: คำนวณแล้ว

source: Compensation history
th_th: ประวัติการจ่ายผลตอบแทน

source: Contracted compensation
th_th: ค่าตอบแทนตามสัญญา

source: Goal achievement
th_th: การบรรลุเป้าหมาย

source: Individual pay range
th_th: ช่วงเงินเดือนรายบุคคล

source: Job architecture
th_th: สถาปัตยกรรมงาน

source: Organization structure
th_th: โครงสร้างองค์กร

source: Paid compensation
th_th: ค่าตอบแทนที่จ่ายแล้ว

source: Pay range
th_th: ช่วงการจ่ายเงิน

source: Pay scale
th_th: อัตราเงินเดือน

source: Performance
th_th: ผลการปฏิบัติงาน

source: Performance review rating
th_th: คะแนนการประเมินผลการปฏิบัติงาน

source: Salary
th_th: เงินเดือน

source: Group {{groupName}} visibility
th_th: การมองเห็นของกลุ่ม {{groupName}}

source: Name/Display name
th_th: ชื่อ/ชื่อที่แสดง

source: No data points
th_th: ไม่มีจุดข้อมูล

source: Team planner preview
th_th: การแสดงตัวอย่างตัววางแผนทีม

source: Clear your filters and your search to be able to reorder columns.
th_th: ล้างตัวกรองและการค้นหาของคุณเพื่อให้สามารถเรียงลำดับคอลัมน์ใหม่ได้

source: Select column {{columnName}}
th_th: เลือกคอลัมน์ {{columnName}}

source: Compensation grid configuration
th_th: การกำหนดค่าตารางผลตอบแทน

source: Boolean
th_th: บูลีน

source: Decimal
th_th: ทศนิยม

source: Entity enum
th_th: ค่า enum ของเอนทิตี

source: Entity reference
th_th: การอ้างอิงเอนทิตี

source: Integer
th_th: จำนวนเต็ม

source: String
th_th: สตริง

source: Visibility
th_th: การมองเห็น

source: Toggle on to make the columns visible in the compensation round grid view. Toggle off to hide them.
th_th: สลับเปิดเพื่อแสดงคอลัมน์ในมุมมองตารางของรอบการชดเชย สลับปิดเพื่อซ่อนคอลัมน์

source: Enable the columns you want the compensation manager and approvers to see.
th_th: เปิดใช้งานคอลัมน์ที่คุณต้องการให้หัวหน้างานค่าตอบแทนและผู้ให้การอนุมัติเห็น

source: Team planner view
th_th: มุมมองแพลนเนอร์ของทีม

source: Column configuration
th_th: การกำหนดค่าคอลัมน์

source: Planner add-ons
th_th: ส่วนเสริมของ Planner

source: Budget rule
th_th: กฎงบประมาณ

source: Calculated field formula
th_th: สูตรของฟิลด์ที่คำนวณ

source: Dependent item
th_th: รายการที่ขึ้นอยู่

source: Target item
th_th: รายการเป้าหมาย

source: Usage
th_th: การใช้งาน

source: One or more of the selected items are currently in use in other areas of the system. You must remove or reassign these dependencies before the items can be deactivated or deleted.
th_th: รายการที่เลือกหนึ่งรายการหรือมากกว่า กำลังถูกใช้งานอยู่ในส่วนอื่นของระบบ คุณต้องลบหรือกำหนดการเชื่อมโยงเหล่านี้ใหม่ก่อน จึงจะสามารถปิดการใช้งานหรือลบรายการเหล่านั้นได้

source: Eligibility rule
th_th: กฎคุณสมบัติ

source: This field has active dependencies and cannot be disabled
th_th: ฟิลด์นี้มีการอ้างอิงที่ใช้งานอยู่และไม่สามารถปิดการใช้งานได้

source: Guaranteed amount rule
th_th: กฎจำนวนเงินรับประกัน

source: Guideline rule
th_th: กฎแนวทาง

source: Payroll
th_th: เงินเดือน

source: Proposal management formula
th_th: สูตรการจัดการข้อเสนอ

source: Used in the following places
th_th: ใช้ในตำแหน่งต่อไปนี้

source: View dependencies
th_th: ดูการอ้างอิงถึง

source: Edit comp round
th_th: แก้ไขรอบการจ่ายผลตอบแทน

source: Departure
th_th: การออกเดินทาง

source: Time in the company
th_th: เวลาที่อยู่ในบริษัท

source: All individuals within the specified population will have assigned guaranteed amount for the selected compensation element.
th_th: บุคคลทุกคนในกลุ่มประชากรที่ระบุจะได้รับจำนวนเงินที่รับประกันสำหรับองค์ประกอบค่าตอบแทนที่เลือกไว้

source: The rule list is empty. Get started by creating a guaranteed amount rule.
th_th: รายการกฎว่างเปล่า เริ่มต้นโดยการสร้างกฎจำนวนที่รับประกัน

source: Guaranteed amount rules
th_th: กฎเกี่ยวกับจำนวนเงินที่รับประกัน

source: No guaranteed amounts rules were established
th_th: ยังไม่ได้กำหนดกฎเกี่ยวกับจำนวนเงินที่รับประกัน

source: Select the compensation element
th_th: เลือกองค์ประกอบค่าตอบแทน

source: The compensation element is required.
th_th: จำเป็นต้องมีองค์ประกอบค่าตอบแทน

source: Set the minimum or fixed value that must be honored.
th_th: กำหนดค่าขั้นต่ำหรือค่าคงที่ที่ต้องปฏิบัติตาม

source: Define the guaranteed amount for this rule and how you want to provide the amount. The guaranteed amount will be reflected in the local worker currency.
th_th: กำหนดจำนวนเงินที่รับประกันสำหรับกฎนี้และวิธีที่ท่านต้องการให้จำนวนเงินดังกล่าว จำนวนเงินที่รับประกันจะแสดงในสกุลเงินท้องถิ่นของพนักงาน

source: Guaranteed amounts
th_th: จำนวนเงินที่รับประกัน

source: Add a name and a description to the rule.
th_th: เพิ่มชื่อและคำอธิบายให้กับกฎนี้

source: The rule name is required.
th_th: จำเป็นต้องระบุชื่อกฎ

source: Comp round guidelines
th_th: แนวทางปฏิบัติของรอบการจ่ายผลตอบแทน

source: Guideline rules
th_th: กฏแนวทางปฏิบัติ

source: Guidelines
th_th: แนวทางปฏิบัติ

source: Add secondary hierarchy
th_th: เพิ่มลำดับชั้นรอง

source: The hierarchy cannot be empty.
th_th: ลำดับชั้นต้องไม่เว้นว่าง

source: Hierarchy
th_th: ลำดับชั้น

source: Select a hierarchy
th_th: เลือกลำดับชั้น

source: Hierarchy preview
th_th: การดูตัวอย่างลำดับชั้น

source: No worker data yet. Import workers via the Data Foundation to view them here.
th_th: ยังไม่มีข้อมูลพนักงาน นำเข้าพนักงานผ่านทางมูลนิธิข้อมูลเพื่อดูข้อมูลที่นี่

source: No selected hierarchy
th_th: ไม่มีลำดับชั้นที่เลือก

source: Secondary hierarchy
th_th: ลำดับชั้นรอง

source: Standard hierarchy
th_th: ลำดับชั้นมาตรฐาน

source: Build hierarchies used to drive round access
th_th: สร้างลำดับชั้นที่ใช้ในการขับเคลื่อนการเข้าถึงรอบ

source: Choose hierarchy configuration
th_th: เลือกการกำหนดค่าลำดับชั้น

source: Select a hierarchy to drive round access
th_th: เลือกลำดับชั้นในการขับเคลื่อนการเข้าถึงรอบ

source: Define hierarchy
th_th: กำหนดลำดับชั้น

source: Define the timeframe for bonus calculations.
th_th: กำหนดช่วงเวลาสำหรับการคำนวณโบนัส

source: Bonus plan period
th_th: ระยะเวลาของแผนโบนัส

source: Period end date
th_th: วันที่สิ้นสุดงวด

source: The period end date cannot be empty.
th_th: ไม่สามารถเว้นว่างวันที่สิ้นสุดรอบระยะเวลาได้

source: Period start date
th_th: วันที่เริ่มต้นของรอบระยะเวลา

source: The period start date cannot be empty.
th_th: ไม่สามารถเว้นว่างวันที่เริ่มต้นรอบเวลาได้

source: Specify the start and end dates of the compensation round.
th_th: ระบุวันที่เริ่มต้นและสิ้นสุดของรอบการชดเชย

source: Compensation round timeline
th_th: ไทม์ไลน์ของรอบการชดเชย

source: Select a data model and set key dates.
th_th: เลือก Data Model และกำหนดวันที่สำคัญ

source: Enable communications
th_th: เปิดใช้งานการสื่อสาร

source: Download payroll data drop
th_th: ดาวน์โหลดข้อมูลการจ่ายเงินเดือน

source: Define a password to download the file.
th_th: กำหนดรหัสผ่านเพื่อดาวน์โหลดไฟล์

source: Export results or integrate via API
th_th: ส่งออกผลลัพธ์หรือผสานรวมผ่าน API

source: Payroll data drop
th_th: การนำเข้าข้อมูลเงินเดือน

source: Define the population(s) for the round
th_th: กำหนดจำนวนประชากรสำหรับรอบ

source: Are you sure you want to publish the comp round?
th_th: คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่รอบการจ่ายผลตอบแทน

source: Publish comp round
th_th: เผยแพร่รอบการจ่ายผลตอบแทน

source: Add bonus plan
th_th: เพิ่มแผนโบนัส

source: Bonus configuration
th_th: การกำหนดค่าโบนัส

source: Define the bonus plans and comp elements for this round
th_th: กำหนดแผนโบนัสและองค์ประกอบค่าตอบแทนสำหรับรอบนี้

source: This bonus plan is already selected in another row.
th_th: ได้มีการเลือกแผนโบนัสนี้ไว้ในแถวอื่นแล้ว

source: Bonus plan
th_th: แผนโบนัส

source: The bonus plan cannot be empty.
th_th: แผนโบนัสต้องไม่เว้นว่าง

source: This comp element is already assigned to another bonus plan.
th_th: องค์ประกอบค่าตอบแทนนี้ถูกกำหนดให้กับแผนโบนัสอื่นอยู่แล้ว

source: One or more comp elements are assigned to bonus plan configuration.
th_th: มีองค์ประกอบค่าตอบแทนหนึ่งรายการหรือมากกว่าที่ถูกกำหนดไปยังการตั้งค่าแผนโบนัส

source: This comp element is already assigned to the salary configuration.
th_th: องค์ประกอบค่าตอบแทนนี้ถูกกำหนดไว้ในการตั้งค่าเงินเดือนแล้ว

source: The comp element cannot be empty.
th_th: องค์ประกอบ comp ต้องไม่เว้นว่าง

source: The selected compensation element is currently in use. To remove it, review its dependencies and remove them first.
th_th: องค์ประกอบค่าตอบแทนที่เลือกกำลังถูกใช้งานอยู่ หากต้องการลบ ให้ตรวจสอบความเชื่อมโยงที่เกี่ยวข้องและลบออกก่อน

source: Comp elements with name {{names}} already exist. Please remove them to proceed.
th_th: องค์ประกอบ Comp ที่มีชื่อ {{names}} มีอยู่แล้ว กรุณาลบออกก่อนเพื่อดำเนินการต่อ

source: No comp elements with the name or code "{{phrase}}"
th_th: ไม่มีองค์ประกอบที่มีชื่อหรือรหัส "{{phrase}}"

source: Select at least one comp element.
th_th: เลือกองค์ประกอบผลตอบแทนอย่างน้อยหนึ่งรายการ

source: Please select at least one element.
th_th: โปรดเลือกอย่างน้อยหนึ่งองค์ประกอบ

source: One or more selected compensation elements are currently in use. To remove them, review their dependencies and remove those first.
th_th: องค์ประกอบค่าตอบแทนที่เลือกอย่างน้อยหนึ่งรายการกำลังถูกใช้งานอยู่ หากต้องการลบ โปรดตรวจสอบส่วนที่ขึ้นอยู่กับองค์ประกอบเหล่านี้และลบส่วนนั้นก่อน

source: Exchange rate group
th_th: กลุ่มอัตราแลกเปลี่ยน

source: Comp tree
th_th: แผนภูมิผลตอบแทน

source: Configuration
th_th: การกำหนดค่า

source: The effective date cannot be empty.
th_th: ไม่สามารถเว้นว่างวันที่มีผลได้

source: The comp round currency cannot be empty.
th_th: สกุลเงินของรอบการชดเชยไม่สามารถเว้นว่างได้

source: Currency
th_th: สกุลเงิน

source: Date at which the adjustments performed in the comp round will come into effect.
th_th: วันที่การปรับเปลี่ยนที่ดำเนินการในรอบการแข่งขันจะมีผลบังคับใช้

source: Exchange rate type
th_th: ประเภทอัตราแลกเปลี่ยน

source: The exchange rate type cannot be empty.
th_th: ประเภทอัตราแลกเปลี่ยนต้องไม่เว้นว่าง

source: Round code
th_th: รหัสรอบ

source: A round with that code already exists
th_th: รอบที่มีรหัสดังกล่าวมีอยู่แล้ว

source: The round code cannot be empty.
th_th: รหัสรอบต้องไม่เว้นว่าง

source: A round with that code cannot be validated at this time. Please try again later.
th_th: ไม่สามารถตรวจสอบรอบที่มีโค้ดนั้นได้ในขณะนี้ โปรดลองอีกครั้งในภายหลัง

source: Comp round owners
th_th: เจ้าของรอบการจ่ายผลตอบแทน

source: Round type
th_th: ประเภทของรอบ

source: Choose the compensation components to include in this round
th_th: เลือกองค์ประกอบค่าตอบแทนที่จะรวมไว้ในการรอบนี้

source: Please make sure at least one round type is enabled.
th_th: โปรดตรวจสอบให้แน่ใจว่าได้เปิดใช้งานประเภทของรอบอย่างน้อยหนึ่งประเภท

source: Salary configuration
th_th: การกำหนดค่าระบบเงินเดือน

source: Select the comp element that will store salary decisions
th_th: เลือกองค์ประกอบค่าตอบแทนที่จะใช้จัดเก็บการตัดสินใจเรื่องเงินเดือน

source: Merit increases and base pay adjustments
th_th: การขึ้นเงินเดือนตามผลงานและการปรับเงินเดือนพื้นฐาน

source: Enter the basic information for the round
th_th: ป้อนข้อมูลพื้นฐานสำหรับรอบ

source: Round details
th_th: รายละเอียดรอบ

source: STI bonus (Short Term Incentive)
th_th: โบนัส STI (สิ่งจูงใจระยะสั้น)

source: Changing the bonus plan will trigger a recalculation of the bonus for the workers in this compensation round. Are you sure you want to proceed?
th_th: การเปลี่ยนแปลงแผนโบนัสจะทำให้มีการคำนวณโบนัสใหม่สำหรับพนักงานในรอบการจ่ายค่าตอบแทนนี้ คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Change bonus plan
th_th: เปลี่ยนแผนโบนัส

source: Incentive payouts and variable pay
th_th: การจ่ายเงินจูงใจและค่าตอบแทนผันแปร

source: You have deselected a bonus plan that's no longer active. Once you save the round, it won't be available for selection again.
th_th: คุณได้ยกเลิกการเลือกแผนโบนัสที่ไม่ได้ใช้งานแล้ว เมื่อคุณบันทึกรอบนี้ แผนดังกล่าวจะไม่สามารถเลือกได้อีกต่อไป

source: Deactivated bonus plan
th_th: ปิดใช้งานแผนโบนัสแล้ว

source: Cut-off date
th_th: วันที่ตัดยอด

source: The cut-off date cannot be empty.
th_th: ไม่สามารถเว้นว่างวันที่สิ้นสุดรอบได้

source: Date at which the data of the workers is to be filtered.
th_th: วันที่จะใช้กรองข้อมูลของพนักงาน

source: The data model cannot be empty.
th_th: แบบจำลองข้อมูลต้องไม่เว้นว่าง

source: Warning!
th_th: คำเตือน!

source: This data model is currently in use; changing it will delete all associated configurations. Are you sure you want to proceed?
th_th: ขณะนี้ Data Modeler นี้กำลังถูกใช้งานอยู่; การเปลี่ยนแปลงจะลบการกำหนดค่าทั้งหมดที่เกี่ยวข้อง คุณแน่ใจหรือว่าต้องการดำเนินการต่อ?

source: Unselect & delete
th_th: ยกเลิกการเลือกและลบ

source: The bonus plan effective date cannot be empty.
th_th: ไม่สามารถเว้นว่างวันที่มีผลบังคับใช้ของแผนโบนัสได้

source: Specify the date at which the compensation adjustments will take effect.
th_th: ระบุวันที่ที่การปรับค่าตอบแทนจะมีผลบังคับใช้

source: Effective dates
th_th: วันที่มีผลบังคับใช้

source: The salary effective date cannot be empty.
th_th: ต้องไม่ปล่อยให้วันที่มีผลของเงินเดือนว่างเปล่า

source: Freeze date
th_th: วันที่ตรึง

source: The freeze date cannot be empty.
th_th: วันที่ระงับไม่สามารถเว้นว่างได้

source: Date after which changes to the data loaded in the data model will not be considered for the comp round.
th_th: วันที่หลังจากนี้ การเปลี่ยนแปลงข้อมูลที่โหลดใน Data Modeler จะไม่ถูกนำมาพิจารณาสำหรับรอบ comp อีกต่อไป

source: The name must be unique.
th_th: ชื่อจะต้องไม่ซ้ำกัน

source: Create compensation round
th_th: สร้างรอบการจ่ายผลตอบแทน

source: Delete report
th_th: ลบรายงาน

source: Are you sure you want to delete this validation report?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบรายงานการตรวจสอบความถูกต้องนี้

source: The report was successfully deleted.
th_th: รายงานถูกลบสำเร็จแล้ว

source: Download report
th_th: ดาวน์โหลดรายงาน

source: All data model fields.
th_th: ฟิลด์ทั้งหมดของ Data Model

source: Define a password to download the file
th_th: กำหนดรหัสผ่านเพื่อดาวน์โหลดไฟล์

source: Select fields:
th_th: เลือกฟิลด์:

source: Only selected fields on the team planner view.
th_th: เฉพาะฟิลด์ที่เลือกไว้ในมุมมองการวางแผนทีมเท่านั้น

source: View & validate round configurations
th_th: ดูและตรวจสอบการกำหนดค่ารอบ

source: An error occurred when generating the report.
th_th: เกิดข้อผิดพลาดขณะสร้างรายงาน

source: The file is being generated; download will start shortly.
th_th: ไฟล์กำลังถูกสร้าง การดาวน์โหลดจะเริ่มเร็วๆ นี้

source: Password
th_th: รหัสผ่าน

source: The password must meet the following requirements:
th_th: รหัสผ่านจะต้องเป็นไปตามข้อกำหนดต่อไปนี้:

source: Special characters allowed: {{characters}}
th_th: อักขระพิเศษที่อนุญาต: {{characters}}

source: Maximum password length: {{n}} characters
th_th: ความยาวสูงสุดของรหัสผ่าน: {{n}} อักขระ

source: Minimum password length: {{n}} characters
th_th: ความยาวขั้นต่ำของรหัสผ่าน: {{n}} อักขระ

source: {{min}}-{{max}} characters long
th_th: ยาว {{min}}-{{max}} อักขระ

source: Must contain at least one lowercase character
th_th: ต้องมีอักขระตัวพิมพ์เล็กอย่างน้อยหนึ่งตัว

source: Must contain at least one number
th_th: ต้องมีอย่างน้อยหนึ่งตัวเลข

source: Must contain at least one uppercase character
th_th: ต้องมีอักขระตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว

source: Generate
th_th: สร้าง

source: Generate report
th_th: สร้างรายงาน

source: Your validation report is being generated. You will be notified when it is ready.
th_th: รายงานการประเมินผลงานของคุณกำลังถูกสร้าง คุณจะได้รับการแจ้งเตือนเมื่อรายงานพร้อม

source: Notes
th_th: หมายเหตุ

source: Rename report
th_th: เปลี่ยนชื่อรายงาน

source: The report was successfully renamed.
th_th: รายงานได้รับการเปลี่ยนชื่อสำเร็จแล้ว

source: View and validate round configurations
th_th: ดูและตรวจสอบการกำหนดค่ารอบ

source: Validation
th_th: การตรวจสอบความถูกต้อง

source: Compensation manager
th_th: หัวหน้างานฝ่ายผลตอบแทน

source: HRBP approval
th_th: การอนุมัติ HRBP

source: Manager +1 review
th_th: การประเมินผลงานของหัวหน้างาน +1

source: HRBP review
th_th: การตรวจสอบโดย HRBP

source: Enable proposal adjustments
th_th: เปิดใช้งานการปรับข้อเสนอ

source: Enable rejection of manager proposal
th_th: เปิดใช้งานการปฏิเสธข้อเสนอของผู้จัดการ

source: Enable rejection of manager+1 proposal
th_th: เปิดใช้งานการปฏิเสธข้อเสนอของผู้จัดการระดับสูงกว่า

source: Actions:
th_th: การดำเนินการ:

source: Comp manager +1
th_th: ผู้จัดการค่าตอบแทน +1

source: Add step
th_th: เพิ่มขั้นตอน

source: Add step above
th_th: เพิ่มขั้นตอนด้านบน

source: Add step below
th_th: เพิ่มขั้นตอนด้านล่าง

source: Please fill in all the mandatory fields in the workflow step.
th_th: โปรดกรอกข้อมูลในฟิลด์บังคับทั้งหมดในขั้นตอนของเวิร์กโฟลว์นี้

source: Apply template
th_th: ใช้เทมเพลต

source: Create a workflow where all stakeholders work in parallel within the same date range, submitting proposals until the end date.
th_th: สร้างเวิร์กโฟลว์ที่ให้ผู้มีส่วนเกี่ยวข้องทุกคนทำงานแบบขนานกันภายในช่วงวันที่เดียวกัน ส่งข้อเสนอได้จนถึงวันสิ้นสุด

source: Collaborative
th_th: ร่วมมือ

source: The end date is required.
th_th: จำเป็นต้องระบุวันที่สิ้นสุด

source: Specify the start and end dates during which edits to the round are permitted.
th_th: ระบุวันที่เริ่มต้นและสิ้นสุดที่อนุญาตให้แก้ไขรอบได้

source: Manager + 1
th_th: ผู้จัดการ + 1

source: Choose how the stakeholder will participate in the round.
th_th: เลือกวิธีที่ผู้มีส่วนได้ส่วนเสียจะเข้าร่วมในรอบนี้

source: Collaboration settings
th_th: การตั้งค่าการทำงานร่วมกัน

source: No access
th_th: ไม่มีสิทธิ์เข้าถึง

source: Read only
th_th: เฉพาะอ่านเท่านั้น

source: Read and write
th_th: อ่านและเขียน

source: Are you sure you want to delete this configuration?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบการตั้งค่านี้?

source: Delete configuration
th_th: ลบการกำหนดค่า

source: The configuration was successfully deleted.
th_th: ลบการตั้งค่าเรียบร้อยแล้ว

source: Current workflow step:
th_th: ขั้นตอนการทำงานปัจจุบัน:

source: Edit step
th_th: แก้ไขขั้นตอน

source: Create a workflow based on a predefined approval hierarchy. Steps follow this order: HRBP review → Compensation Manager proposal → Compensation Manager +1 approval → HRBP approval.
th_th: สร้างเวิร์กโฟลว์ตามลำดับขั้นการอนุมัติที่กำหนดไว้ล่วงหน้า ขั้นตอนจะเป็นไปตามลำดับนี้: การทบทวนโดย HRBP → ข้อเสนอของผู้จัดการฝ่ายค่าตอบแทน → การอนุมัติโดยผู้จัดการฝ่ายค่าตอบแทนระดับ +1 → การอนุมัติโดย HRBP

source: Hierarchy-driven
th_th: ขับเคลื่อนด้วยลำดับชั้น

source: Preview template
th_th: ดูตัวอย่างเทมเพลต

source: Applying this template will replace all your current workflow configurations. This action cannot be undone.
th_th: การใช้เทมเพลตนี้จะเป็นการแทนที่การกำหนดค่าเวิร์กโฟลว์ปัจจุบันทั้งหมดของคุณ การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Replace current workflow?
th_th: แทนที่เวิร์กโฟลว์ปัจจุบันหรือไม่?

source: At least one of the following workflow steps must be enabled: {{steps}}.
th_th: ต้องเปิดใช้งานขั้นตอนเวิร์กโฟลว์อย่างน้อยหนึ่งขั้นตอนต่อไปนี้: {{steps}}.

source: Collaborative workflow
th_th: เวิร์กโฟลว์แบบทำงานร่วมกัน

source: Manager +1 approval
th_th: การอนุมัติจากผู้จัดการลำดับถัดไป (+1)

source: Manager proposal
th_th: ข้อเสนอของผู้จัดการ

source: Create a workflow from a blank canvas. You have full flexibility to define, add, and configure each step to match your needs.
th_th: สร้างเวิร์กโฟลว์จากผืนผ้าใบเปล่า คุณมีความยืดหยุ่นเต็มที่ในการกำหนด เพิ่ม และกำหนดค่าทุกขั้นตอนให้ตรงกับความต้องการของคุณ

source: Start from scratch
th_th: เริ่มใหม่ตั้งแต่ต้น

source: Not started
th_th: ยังไม่ได้เริ่มต้น

source: Step actions
th_th: การดำเนินการขั้นตอน

source: Actor
th_th: ผู้ปฏิบัติงาน

source: An actor can not be used in more than one configuration.
th_th: นักแสดงไม่สามารถใช้ในมากกว่าหนึ่งการกำหนดค่าได้

source: Choose one or more actors
th_th: เลือกนักแสดงหนึ่งคนหรือมากกว่า

source: The actor can not be empty.
th_th: ตัวดำเนินการต้องไม่เว้นว่าง

source: Actors & permissions
th_th: ผู้เกี่ยวข้องและสิทธิ์การใช้งาน

source: Add configuration
th_th: เพิ่มการตั้งค่า

source: Step {{stepNumber}}: {{stepName}}
th_th: ขั้นตอนที่ {{stepNumber}}: {{stepName}}

source: Step {{count}}
th_th: ขั้นตอนที่ {{count}}

source: Delete step
th_th: ลบขั้นตอน

source: Are you sure you want to delete the workflow step?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบขั้นตอนเวิร์กโฟลว์นี้?

source: Delete workflow step
th_th: ลบขั้นตอนเวิร์กโฟลว์

source: The workflow step was successfully deleted.
th_th: ลบขั้นตอนของเวิร์กโฟลว์เรียบร้อยแล้ว
